# ReloadSwapOutInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReloadSwapOutInfo Properties
ReloadSwapOutInfo Class See Also
---
The ReloadSwapOutInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentVersion | New version. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Part | The ElementId of part being swapped. |
| PreviousVersion | Previous version. |
| WasSwapped | Whether the swap out was successful. |

# See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace